
main(List<String> args) {
  // var htmlStr = '''"<div class="main-wrap content-wrap"> <div class="headline"> <div class="img-place-holder"></div> </div> <div class="content-inner"> <div class="question"> <h2 class="question-title">无知之幕</h2> <div class="answer"> <div class="meta"> <img class="avatar" src="http://pic1.zhimg.com/14735c7bc_is.jpg"> <span class="author">于淼，</span><span class="bio">6*7=?</span> </div> <div class="content"> <p>最近去加州大学欧文分校交流了两周，听说了欧文分校出现过捐资冠名学院的教授因为被控多名性骚扰教职人员而一夜除名的事。捐钱对于高校属于重要创收来源，楼名字卖了可以卖教室，甚至校园里的椅子都有冠名纪念校友的状况。但性骚扰这事放到任何一个地方都不仅仅是低端问题了，属于严重的道德甚至法律问题，校方一夜除名并不意外。有些人会讨论是否涉及契约问题，契约有很多种，贩卖人口也讲一手交钱一手交人，但不合理合法的契约就可以判断无效。其实，如果自己本身有问题还要去冠名来树立形象，这其实是一种名誉绑架，高校创收归创收，来源还是要注意的，不做好调查或者当事人不报告就觉得无所谓影响非常坏。校园性骚扰其实是个台面下的问题，能报出来的还是少数，所以出现一个严惩一个没有什么问题。很多人讨论说会搞得人心惶惶，但我觉得这属于无知之幕。</p> <p>所谓无知之幕，就是说你永远不知道下一个受害人是谁，因此保护措施就一定要按照下一个受害人是自己或自己的亲朋好友来设计。我不清楚这么简单的一个道理为什么很多人不理解，规矩下的自由自由度最高，无序的自由一定造成意见割裂与对立。不过很多人也会去争论度的问题，如果搞不清度的把握，那么保守点就可以了，再或者，你可以问啊。什么都不说按照自己的自由度聊天是不成熟的表现，尊重别人也会给自己赢得自由空间。我有个师兄已经独立成立课题组，只要跟女生讨论问题，一定把办公室门打开。也许有人会说这是不是过敏，其实不是，因为校园里确实不应该出现师生关系亲密。对于没问题的人而言，开门并不损失，而有问题的人开门的风气就会有威慑效果。当然，学术问题确实存在机密内容，开门讨论可能造成泄密，不过同一院系竞争关系是可以在招人时控制的，单一方向选一个就可以，同系竞争本身就是很多潜在问题的开端。只是现在可能不论异性同性都得注意了，这就是社会伦理需要发展的地方，尽量给所有人最大且不干涉他人的空间，最大是权利，不干涉他人是义务，不可偏废。</p> <p>不过，眼下的信息时代存在一个隐忧，无知之幕的现实基础正在被技术进步破坏。很多时候，有些人是知道自己不会成为受害者才肆无忌惮地争取利益。例如商品的差异定价，如果商家对你特别了解，它不会给你那个充分竞争的最低价，而是会根据你的消费水平推断出你能承受的最高价来维持自己的最高利润。而且你很有可能完全无法发现，这也是你在固定消费模式后决定的。个性化推荐的背后有着巨大的套利空间，此时游戏规则设计里如不考虑无知之幕或者通过技术与数据追踪突破了无知之幕，那么每个人将可能面临一个看似合理但实际被奴役的未来。在这样的空间里你的价值将被榨取到最后一滴而不自知，很多人则可能面临被侵害但上诉无门或彻底被主流声音所抛弃的境遇。对未来的无知是公平的最后一道保护伞，突破了这个，利益冲突就实质上成了社会伦理问题，这个时候会有些人成为社会的永恒弃子与棋子。但技术也可以用来巩固无知之幕，虽然事实公平很难保证，但起码在社会运行中，原则上给所有人公平自由的制度。</p> <p>维护无知之幕的技术需要保证个人信息不被追踪，例如现在随便一个网页里就有大量的追踪代码，很多浏览器可以屏蔽掉。但商家可能会用无法提供个性化推荐来抵制用户采用类似技术，其实我觉得从隐私保护角度，个性化推荐可以做，但不能精确到人，算法设计时要强制类似用户不少于 200 人才能构建算法，同时 200 人的信息要经过加密，针对个人的算法需要在法律上禁止。也就是对个人自己或第三方知情权有个最低噪音，确保个人与第三方无法准确知道对己方最有利的策略。没错，不仅是第三方，还要包括自己，如果一个人知道自己一定存在或不存在某种风险，那么其就可以依赖这点来突破有无知之幕的游戏规则。举个例子，技术进步后，通过组学技术某人知道自己无大病风险，此时他就不会购买保险，当所有低风险人群都不够买保险时，大病保险的保额一定会提高，这样高风险人群基本从出生就决定了较高的生存成本，这就构成问题了，人人生而平等的根基不存在了。</p> <p>20 世纪的技术进步是普惠的，21 世纪的技术进步是优先照顾少数人的，因为技术研发成本越来越高。这就是那个挤公交问题，先上车的人上车后其实并不愿与后面上车的人均摊利益。同时，最新技术造成的不平等也会越来越大，当一项技术无法从成本与资源上实现普惠时，社会割裂的可能性就很大了。所以，技术开发是要讲伦理的，优先开发普惠技术并在制度建设中维护无知之幕，否则弱肉强食的丛林法则会最终吞噬掉人类文明的基础。</p> <div class="view-more"><a href="http://zhuanlan.zhihu.com/p/43960917">查看知乎讨论</a></div> </div> </div> </div> </div> </div><script type=“text/javascript”>window.daily=true</script>"''';
  // var newStr = htmlStr.replaceAll(new RegExp('<.+?>'), '');
  // print(newStr);
  SortedCollection coll = new SortedCollection(sort);
  print(coll.compare is Function);
  print(coll.compare is Compare);
  SortedCollection2 coll2 = new SortedCollection2(sort);
  print(coll2.compare is Function);
  print(coll2.compare is Compare);
}

typedef int Compare(Object a, Object b);

class SortedCollection {
  Compare compare;

  SortedCollection(this.compare);
}

 // Initial, broken implementation.
 int sort(Object a, Object b) => 0;

 class SortedCollection2 {
  Function compare;

  SortedCollection2(int f(Object a, Object b)) {
    compare = f;
  }
}
